/*-----------------------------------------------------------
		 包含头文件
-----------------------------------------------------------*/
#include "system_init.h"
#include "c8051f020.h"
#include "common.h"
#include "CharLCD.h"

//--------------------------------------------------------------
// 函数功能: 系统初始化
// 入口参数: 无
// 返回参数: 无
//	全局变量: 无   
// 备注：
//--------------------------------------------------------------
void init(void)
{
  WDTCN = 0xDE;				  // 关闭看门狗
  WDTCN = 0xAD;

  PORT_Init();				  //端口初始化
  OSCILLATOR_Init (); 	//时钟初始化

  LCM_Init();	    		  //液晶初始化
}


//----------------------------------------------------------------------------
//					端口初始化
//----------------------------------------------------------------------------
void PORT_Init (void)          
{	
  P0MDOUT  = 0xFF;
  P1MDOUT  = 0xFF;
  P2MDOUT  = 0xFF;

  P74OUT   = 0X0C;	 // 用于彩屏及矩阵键盘，矩阵键盘高四位有接上拉电阻，所以设置成漏极开路
  XBR2     = 0x40;
}

//----------------------------------------------------------------------------
//			时钟初始化
//----------------------------------------------------------------------------

void OSCILLATOR_Init (void)
{

		int i;                      // delay counter

    OSCXCN = 0x67;              // start external oscillator with
                                // 22.1184MHz crystal
    for (i=0; i < 256; i++);    // XTLVLD blanking interval (>1ms)

    while (!(OSCXCN & 0x80)) ;  // Wait for crystal osc. to settle

    OSCICN = 0x88;              // select external oscillator as SYSCLK
                                // source and enable missing clock                              
}

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
