//-----------------------------------------------------------------
// 独立键盘模块头文件
// 头文件名: key.h
// 作    者: 凌智电子
// 编写时间: 2014-02-01
// 修改日期: 2014-02-02
// 当前版本: V1.0.1 
// 历史版本:
//-----------------------------------------------------------------

#ifndef KEY_H
#define KEY_H


#include <reg52.h>

//-----------------------------------------------------------------------------
//定义按键
//-----------------------------------------------------------------------------
sbit KEY1=P3^4;   //定义按键输入端口
sbit KEY2=P3^5;
sbit KEY3=P3^6;
sbit KEY4=P3^7;

sbit  LED1 = P3^1; // 按键指示灯
sbit  LED2 = P3^2;

#define uchar unsigned char
#define uint unsigned int
#define ulong unsigned long

extern uchar Key_Scan(void);

#endif
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------