//-----------------------------------------------------------------------------
// 程序描述:   引脚宏定义头文件:common.h
// 创建人  :	陈佳荣
// 编写时间:	2013年8月1日
// 版本号  :	V3.0
//-----------------------------------------------------------------------------
#ifndef _common_H_
#define _common_H_

#include <c8051f020.h>
/*--------------------------------------------------------------
		宏定义数据类型
---------------------------------------------------------------*/
#define wave_num 400    // 存储波形数据点数
#define screen_y_max 258	// 边框对应坐标,y轴最大坐标
#define screen_y_min 3		// y轴最小坐标
#define screen_x_min 19		// x轴最小坐标
/*--------------------------------------------------------------
		外部变量声明
---------------------------------------------------------------*/
extern bit trigger_flag;		// 满足触发条件的标志位
sbit samp_end=P1^5;		// 判断FPGA是否采集结束，低电平有效

//******************************************************************
//                           fifo读取接口
sbit clk_read_fifo=P1^4;	// 读取ram中数据

#define set_clk_read_fifo clk_read_fifo=1
#define clr_clk_read_fifo clk_read_fifo=0
//******************************************************************

//******************************************************************
//                          信号调理接口
sbit s1 =P1^6;	// 	s1      s2	
sbit s2 =P1^7; //	   0   	  0		衰减4倍
					//	   0       1		放大2.5倍
				   //    1	     0		放大25倍
//******************************************************************

#endif








