//-----------------------------------------------------------------
// 程序描述:
// 　　C8051F020_AD9854测试程序_V2.0
// 作　　者: 凌智电子
// 开始日期: 2015-07-16
// 完成日期: 2015-07-16
// 修改日期: 2015-07-16
// 当前版本: V2.0
// 历史版本:
// 　- V1.0: 基本的AD9854并行控制输出，液晶显示功能
// 　- V1.1：并行控制转串行控制
// 　- V2.0: 测试AD9854各个调制波形输出功能
// 调试工具: 凌智C8051F核心板V1.1、1602液晶屏
// 说　　明: 
//				(1) 调试使用的系统时钟频率Fsysclk=22.1184MHz;
//     		(2) AD9854的数据传输方式:并行传输方式;
//				(3) AD9854_IO与凌智C8051F核心板V1.1连接方式如32-45行代码提示连接
//        (4) 本测试程序实现各个调制波形输出功能,通过按键'K1'控制切换输出调制波形
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <c8051f020.h>
#include "system_init.h"
#include "delay.h"
#include "AD9854.h"
#include "CharLCD.h"
#include "key.h"
#include "type.h"

//-----------------------------------------------------------------
//               IO 连接说明
//-----------------------------------------------------------------
//    AD9854         |      020         
// ADDER_BUS[5:0]    -->   P1{5:0}
// DATA_BUS[7:0]     -->   P2{7:0}
// RD                -->   P07
// WR                -->   P06
// UDCLK             -->   P05
// RESET             -->   P04
// S/P               -->   P00
// OSK               -->   P01
// FDSTA             -->   P02
//-----------------------------------------------------------------


//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main(void)
{  
	uchar key_value = 0,key_count = 0;
	
  init();
	WrCLcdC(0x06);
	WriteString(1, 1,"  AD9854 TEST!  ");
	WriteString(2, 1,"K1:  Select Wave");
	
  while (1)
  {
		key_value = Key_Scan ();				           // 获取键值
		if(key_value==1)
		{
			key_count ++;
			WriteString(2, 1,"                 ");	
			switch (key_count)
  	  {
			 	case  1 :	{                             
  	  			        AD9854_Init();                      
                    AD9854_SetSine (1000000, 4050);     				// AD9854正弦波点频输出，1M500 mv	  	
										WriteString(2, 1,"     SINE        ");
  	              }break;
  	   case  2 :	{
  				          AD9854_InitFSK();
										AD9854_SetFSK(10000,100000);								//FDATA高电平输出100k，低电平输出10k，控制信号1k方波 	
										WriteString(2, 1,"     FSK         ");
  	              }break;
  	   case  3 :	{
  	  			        AD9854_InitBPSK();                      
                    AD9854_SetBPSK(0, 8192);    								// FDATA高电平，相位为0，低电平相位为180	  	
										WriteString(2, 1,"     BPSK        ");                  
                  }break;
  	   case  4 :	{
  				          AD9854_InitRFSK();                      
                    AD9854_SetRFSK(1000000,40000000,100000,524288);  // FDATA为低电平为增斜率，高电平为降斜率 	
										WriteString(2, 1,"     RFSK        ");    
                  }break;
  	   case  5 :	{
  	  			        AD9854_InitAM();
										AD9854_SetAM(4000);										  			//am	
										WriteString(2, 1,"      A M        ");     
                  }break;
  	   case  6 :	{
  				          AD9854_InitOSK();                     
                    AD9854_SetOSK (100);    										 // OSK高电平，幅值增加；低电平幅值减少，100为变化的斜率（满幅输出） 		
										WriteString(2, 1,"      OSK        ");     
                   }break;
		   case  7 :	{
  				          AD9854_InitChirp();                     
                    AD9854_SetChirp (1000000,100000,524288);   //FDATA高电平，信号频率停止；	  	
										WriteString(2, 1,"     CHIRP        ");
										key_count= 0 ;
                   }break;
  	    default :	break;
		  }
		}		
  }
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------


