/*
 **********************************************************************
 *Copyright(c)		Lance Zhang
 *Identification	CHIC
 *Describtion		Template
 *
 *Present Version	1.0
 *Writer			Lance Zhang
 *Date				8/16/2018
 **********************************************************************
**中断服务函数文件
 **********************************************************************
 *中断服务函数不能放在.cpp文件中，因此需要额外建立一个.c文件
 **********************************************************************
**/
#ifndef __INTERRUPT_H
#define __INTERRUPT_H
#include "sys.h"

#endif
