//-----------------------------------------------------------------
// 程序描述:
// 		 定时器中断驱动程序
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2020-11-11)定时器中断初始化，定时器中断服务函数
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2
// 说    明: 
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "timer.h"
#include "led.h"
//-----------------------------------------------------------------

TIM_HandleTypeDef TIM3_Handler;      // 定时器3句柄 
uint8_t TIM_FLAG = 0;
//-----------------------------------------------------------------
// vvoid TIM3_Init(u16 arr,u16 psc)
//-----------------------------------------------------------------
//
// 函数功能: 定时器3中断初始化
// 入口参数: u16 arr：自动重装值
//					 u16 psc：时钟预分频数
// 返回参数: 无
// 注意事项: 定时器溢出时间计算方法:Tout=((arr+1)*(psc+1))/Ft us.
//					 Ft=定时器工作频率,单位:Mhz
//					 这里使用的是定时器3!(定时器3挂在APB1上)
//
//-----------------------------------------------------------------
void TIM3_Init(u16 arr,u16 psc)
{  
  TIM3_Handler.Instance=TIM3;                          		// 通用定时器3
  TIM3_Handler.Init.Prescaler=psc;                     		// 分频系数
  TIM3_Handler.Init.CounterMode=TIM_COUNTERMODE_UP;    		// 向上计数器
  TIM3_Handler.Init.Period=arr;                        		// 自动装载值
  TIM3_Handler.Init.ClockDivision=TIM_CLOCKDIVISION_DIV1;	// 时钟分频因子
  HAL_TIM_Base_Init(&TIM3_Handler);
    
  HAL_TIM_Base_Start_IT(&TIM3_Handler); // 使能定时器3和定时器3更新中断：TIM_IT_UPDATE   
}

//-----------------------------------------------------------------
// void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
//-----------------------------------------------------------------
//
// 函数功能: 定时器底册驱动，开启时钟，设置中断优先级
// 入口参数: TIM_HandleTypeDef *htim：定时器3句柄
// 返回参数: 无
// 注意事项: 此函数会被HAL_TIM_Base_Init()函数调用
//
//-----------------------------------------------------------------
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
{
  if(htim->Instance==TIM3)
	{
		__HAL_RCC_TIM3_CLK_ENABLE();            // 使能TIM3时钟
		HAL_NVIC_SetPriority(TIM3_IRQn,1,3);    // 设置中断优先级，抢占优先级1，子优先级3
		HAL_NVIC_EnableIRQ(TIM3_IRQn);          // 开启ITM3中断   
	}
}

//-----------------------------------------------------------------
// void TIM3_IRQHandler(void)
//-----------------------------------------------------------------
//
// 函数功能: /定时器3中断服务函数
// 入口参数: 无
// 返回参数: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void TIM3_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&TIM3_Handler);
}

//-----------------------------------------------------------------
// void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
//-----------------------------------------------------------------
//
// 函数功能: 定时器3中断服务函数
// 入口参数: TIM_HandleTypeDef *htim：定时器3句柄
// 返回参数: 无
// 注意事项: 无
//
//-----------------------------------------------------------------
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if(htim==(&TIM3_Handler))
  {
//		LED_B_Toggle;        // LED_B反转
	  TIM_FLAG = 1;
  }
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
