//-----------------------------------------------------------------
// 程序描述:
// 　　51_AD9854测试程序_V1.0
// 作　　者: 凌智电子
// 开始日期: 2017-06-1
// 完成日期: 2017-06-4
// 修改日期: 2015-06-4
// 当前版本: V1.0
// 历史版本:
// 　- V1.0: 基本的AD9854并行控制输出，液晶显示功能
// 调试工具: 51开发板、1602液晶屏
// 说　　明: 
//				(1) 调试使用的系统时钟频率Fsysclk=12MHz;
//     		(2) AD9854的数据传输方式:并行传输方式;
//				(3) AD9854_IO与51开发板连接方式如29-37行代码提示连接
//        (4) 本测试程序实现基本的AD9854控制输出，即1MHz正弦波输出。可通过修改49行(fre值)代码修改输出频率

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <reg52.h>
#include <AD9854.h>
#include <init.h>

//-----------------------------------------------------------------
//               IO 连接说明
//-----------------------------------------------------------------
//    AD9854         |      51         
//   ADDER_BUS[5:0]    -->   P1{5:0}
//   DATA_BUS[7:0]     -->   P3{7:0}
//   AD9854_RST         -->   P2^0;    		//控制信号引脚
//   AD9854_SP          -->   P2^1;
//   AD9854_OSK         -->   P2^2; 			//osk
//   AD9854_UDCLK       -->   P2^4; 
//   AD9854_WR          -->   P1^6;
//   AD9854_FDATA       -->   P2^6;       //fsk/bpsk/hold
//   AD9854_RD          -->   P2^7;
//-----------------------------------------------------------------
void main()
{
	
 	  ulong fre;
    init();	 
  	LCD_Clear();//清屏
	  LCD_Write_String(1, 0,"  AD9854 TEST!  ");
	  LCD_Write_String(1, 1,"Fre:         Hz");
    AD9854_Init();
     
		     fre = 1000000;
	  if (fre > 99999999)
		{
			fre = 99999999;
		}
		LCD_Write_String(6, 1,"1000000");
		AD9854_SetSine ( fre , 4095 );
	  while(1)
		{;}

	
}