//-----------------------------------------------------------------
// 程序描述:
// 　　stm32_AD9854测试程序_V1.2
// 作　　者: 凌智电子
// 开始日期: 
// 完成日期: 
// 修改日期: 
// 当前版本: V1.2
// 历史版本:
// 　- V1.0: 基本的AD9854并行控制输出，液晶显示功能
// 　- V1.1：并行控制转串行控制
//   - V1.2：并行控制转串行控制,频率按键可调,增加了扫频功能
// 调试工具: 凌智STM32F103核心板V2.2、LZE_ST_LINK2
// 说　　明: 
//				(1) 调试使用的系统时钟频率Fsysclk=72MHz;
//     		(2) AD9854的数据传输方式:串行传输方式;
//				(3) AD9854_IO与凌智STM32F103核心板V2.2连接方式如下
//-----------------------------------------------------------------
//               IO 连接说明
//-----------------------------------------------------------------
//    AD9854         |      STM32               
// PIV               -->   +5V
// GND               -->   GND
// A0/SDIO           -->   GPIOA_PIN0/PA0				
// A1/SDO            -->   GPIOA_PIN1/PA1			
// A2/IORST          -->   GPIOA_PIN2/PA2
// RD                -->   GPIOC_PIN8/PC8
// WR                -->   GPIOC_PIN9/PC9
// UDCLK             -->   GPIOC_PIN10/PC10
// RESET             -->   GPIOC_PIN11/PC11
// S/P               -->   GPIOC_PIN12/PC12
//-----------------------------------------------------------------
//				(4) 由于AD9854功耗高, 请保证AD9854模块的供电功率, 供电电源建议5V1A电源
//        (5) K1: 功能选择键, 按下K1分别依次顺序循环选择SINE和1HZ-135MHZ扫频输出
//						K2: SINE模式下使用, 每按一下, 表示频率加 
//						K3: SINE模式下使用, 每按一下, 表示频率减

//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "Delay.h"
#include "key.h"
#include "AD9854.h"

u32 F=1000;  		// 设置正弦波的频率（1~100MHz）
u16 A=4095;			// 设置正弦波的幅度（0~4095）

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{
	u8 Key_Count=0;
	u8 s= 0;
	Delay_1ms(100);
	Key_Init();                  // 独立键盘初始化
	GPIO_AD9854_Configuration(); // AD9854IO口初始化
	Delay_1ms(5);  
	AD9854_Init ();
	Delay_1ms(20);

	while (1)
	{	
		 s= Key_Scan(); // 按键状态扫描
		 if(s==1)
			{
			 Key_Count ++;
					switch (Key_Count)
					{
						case  1 :	{
												AD9854_Init ();
												Delay_1ms(20);
												AD9854_SetSine (F, A);
											}break;
					
					 case  2 :	{  		
//												AD9854_Init ();				 
												Delay_1ms(20);
												Sweep_out();
												Key_Count=0;
								        F=1000;  		
                        A=4095;			
											 }break;
						default :	break;
				 }	
			 }
			if(s==2&&Key_Count==1)
			{
					if (F < 135000000)
					{
						if (F < 1000)									// 输出频率小于1kHz，按100Hz步进
						{
							F += 100;
						}
						else if (F< 10000)						// 输出频率小于10kHz，按1kHz步进
						{
							F += 1000;
						}
						else if (F < 100000)					// 输出频率小于100kHz，按10kHz步进
						{
							F += 10000;
						}
						else if (F < 1000000)					// 输出频率小于1MHz，按100kHz步进
						{
							F += 100000;
						}
						else if (F < 10000000)				// 输出频率小于10MHz，按1MHz步进
						{
							F += 1000000;
						}
						else 
						{
							F += 5000000;								// 输出频率小于140MHz，按5MHz步进
						}
					}
						AD9854_SetSine (F, A);
					
				}
				if(s==3&&Key_Count==1)
				{
					if (F > 100)
					{
						if (F > 10000000)
						{
							F -= 5000000;
						}
						else if (F > 1000000)
						{
							F -= 1000000;
						}
						else if (F > 100000)
						{
							F -= 100000;
						}
						else if (F > 10000)
						{
							F -= 10000;
						}
						else if (F > 1000)
						{
							F -= 1000;
						}
						else if (F > 100)
						{
							F -= 100;
						}
					}
					AD9854_SetSine (F, A);	
				}
		}
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
