//-----------------------------------------------------------------
// 程序描述:
//     HD44780(KS0066U)内核的字符型LCM子程序
// 作    者: 凌智电子
// 开始日期: 2014-02-01
// 完成日期: 2014-02-02
// 修改日期: 2014-03-03
// 当前版本: V1.0.2
// 历史版本:
//	  -V1.0:(2014-02-02)基本的液晶显示功能
//	-V1.0.1: (2014-02-16)头文件中不包含其他头文件
//	-V1.0.2: (2014-03-03)更改液晶的IO配置
// 调试工具: 凌智STM32核心开发板、1602液晶屏、LZE_ST_LINK2
// 说    明:
//     (1)调试使用的系统时钟频率Fsysclk=72MHz;
//     (2)LCM的接口方式:间接控制方式;
//     (3)LCM的数据线(14-11脚)和控制线可以和单片机的任意I/O口相连,使程序更具
//        通用性,且因它们均外接上拉电阻,需要在单片机配置中设置为推挽方式.
//     (4)LCM初始化步骤,使用时根据需要选择;
//     (5)读BF/AC函数和读LCM数据函数一般很少用到,这里不编写;
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include <stm32f10x.h>
#include "Delay.h"
#include "CharLCD.h"

//-----------------------------------------------------------------
// LCM的CGRAM数据定义
//-----------------------------------------------------------------
// 字符码即是CGROM的地址
u8 CGTab[64]={
	0x08,0x0F,0x12,0x0F,0x0A,0x1F,0x02,0x02,	//"年"字符码=00H或08H
   0x0F,0x09,0x0F,0x09,0x0F,0x09,0x11,0x00,	//"月"字符码=01H或09H
   0x1F,0x11,0x11,0x1F,0x11,0x11,0x1F,0x00,	//"日"字符码=02H或0AH
   0x11,0x0A,0x04,0x1F,0x04,0x1F,0x04,0x00,	//"￥"字符码=03H或0BH
   0x0E,0x00,0x1F,0x0A,0x0A,0x0A,0x13,0x00,	//"元"字符码=04H或0CH
   0x18,0x18,0x07,0x08,0x08,0x08,0x07,0x00,	//"℃"字符码=05H或0DH
   0x0F,0x0F,0x0F,0x0A,0x0F,0x12,0x07,0x1F,	//"星"字符码=06H或0EH
   0x00,0x00,0x0E,0x00,0x00,0x1F,0x00,0x00 	//"二"字符码=07H或0FH
	};
// 0x04,0x04,0x04,0x07,0x04,0x04,0x1f,0x00,	//"上"字符码
// 0x1f,0x04,0x04,0x06,0x05,0x04,0x04,0x00,	//"下"字符码=07H

//-----------------------------------------------------------------
// 程序区数据表格:演示数据
//-----------------------------------------------------------------
u8 tab1[] = {
   0x57,0x65,0x6C,0x63,0x6F,0x6D,0x65,0x20,	// Welcome
   0x74,0x6F,0x20,				             			// to
   0x75,0x73,0x65,0x21,0x20                	// use!
	};	

u8 tab2[] = {
	0x54,0x65,0x6C,0x3A,                    	// Tel:
   0x31,0x33,0x39,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38//13912345678
	};
u8 tabdy[] = {
   0x4D,0x44,0x44,0x2D,0x31,0x20,0x20,      // MDD-1
   0x03,0x33,0x35,0x38,0x2E,0x30,0x30,0x04,0x20,// ￥150.0元
   0x32,0x30,0x31,0x34,0x00,0x32,0x01,0x30,0x37,0x02,0x20,
   0x54,0x3D,0x31,0x35,0x05                 // T=32C
	};

//-----------------------------------------------------------------
// 全局变量:内RAM存储单元定义
//-----------------------------------------------------------------
u8 lcdbuff;
u8 lcdbuff_1;

//-----------------------------------------------------------------
// 初始化程序区
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// void LCM_Init (void)
//-----------------------------------------------------------------
//
// 函数功能: LCM初始化
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);CG_Write()     
// 注意事项: 
//     (1)具体流程查看HD44780(KS0066)的中文数据手册;
//     (2)因5V的液晶模块在3.3V电压工作的STM32单片机中应用,而其接口未
//        接上拉电阻,所以需要多次(大于4次)对功能设置进行初始化才能液晶模块正常工作
//-----------------------------------------------------------------
void LCM_Init (void)
{
	u8 i;
	
	Delay_50ms(10);									// 延时等待液晶稳定		
	GPIO_LCM_Configuration();				// 液晶IO口初始化
	for (i=5; i>0; i--)
	{
		WrCLcdC(0x28);						   	// LCM功能设置:4位数据接口,2行5*7显示
	}
	WrCLcdC(0x01);						      // LCM清屏
	WrCLcdC(0x06);						      // LCM输入方式设置:读写操作后AC自增1
	WrCLcdC(0x0F);						      // LCM显示控制设置:开,光标和闪烁显示
	WrCLcdC(0x0C);						      // LCM显示控制设置:开显示
	CG_Write();							      	// LCM自定义字符库
}

//-----------------------------------------------------------------
// void GPIO_LCM_Configuration(void)
//-----------------------------------------------------------------
//
// 函数功能: LCM IO配置
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: RCC_APB2PeriphClockCmd();GPIO_Init();   
// 注意事项: 各引脚设置为推挽输出
//			名称 	引脚		名称 引脚
//			RS   	PD0			D4		PD4
//			RW		PD1			D5		PD5
//			E			PD2			D6		PD6
//										D7		PD7
//-----------------------------------------------------------------
void GPIO_LCM_Configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	// 使能时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);  
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);  
	// 									     	        RS		   		RW			  				    		 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1
	//									D4						D5					D6						D7
								  | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6| GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	//																E
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
}
//-----------------------------------------------------------------
// 功能程序区
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// void WrCLcdC (u8 lcdcomm)
//-----------------------------------------------------------------
//
// 函数功能: 写LCM的指令代码
// 入口参数: LCM指令
// 返回参数: 无
// 全局变量: lcdbuff:LCM命令/数据暂存单元,允许位操作
// 调用模块: Wr_CodeData()     
// 注意事项:
//-----------------------------------------------------------------
void WrCLcdC (u8 lcdcomm)
{
  lcdbuff = lcdcomm;
	lcdbuff_1 = lcdcomm;
	LCM_RS_clr;                             	// RS=0,RW=0,E=1-0:允许写
	LCM_RW_clr;
	Wr_CodeData();                      			// 写入LCM指令                             
}

//-----------------------------------------------------------------
// void WrCLcdD (u8 lcddata)
//-----------------------------------------------------------------
//
// 函数功能: 写LCM要显示的数据
// 入口参数: 待写的数据
// 返回参数: 无
// 全局变量: lcdbuff:LCM命令/数据暂存单元,允许位操作
// 调用模块: Wr_CodeData()     
// 注意事项:	 RS=1,RW=0,E=1-0:允许写
//-----------------------------------------------------------------
void WrCLcdD (u8 lcddata)
{
  lcdbuff = lcddata;
	lcdbuff_1 = lcddata;
	LCM_RS_set;                             
	LCM_RW_clr;	
	Wr_CodeData();
}

//-----------------------------------------------------------------
// void WriteString (u8 x, u8 y, u8 *s)
//-----------------------------------------------------------------
//
// 函数功能: 指定位置显示一串字符串
// 入口参数: x:行, y:列, *s:字符指针
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)     
// 注意事项: x的值只能为1或2, y≤16
//-----------------------------------------------------------------
void WriteString (u8 x, u8 y, u8 *s)          
{
	// 设置LCM显示DDRAM起始地址
  if (x == 1)
		WrCLcdC(0x80+y-0x01);										// 第一行
	else 
		WrCLcdC(0xc0+y-0x01);										// 第二行
	// 显示字符串					      	
	for ( ; *s != '\0'; s ++)
	{
		WrCLcdD (*s);	
	}	
}


//-----------------------------------------------------------------
// void Wr_CodeData (void)
//-----------------------------------------------------------------
//
// 函数功能: 写操作共同部分程序
// 入口参数: 无 
// 返回参数: 无
// 全局变量: 无
// 调用模块: 无     
// 注意事项:  
//-----------------------------------------------------------------
 void Wr_CodeData (void)
{	
	// 写高半字节
	GPIOD->ODR &= 0Xff0f;											// 清数据位
	lcdbuff &= 0xf0;        									// 清控制位
	GPIOD->ODR |= lcdbuff;
	GPIOA->ODR &= 0xfeff;
	Delay_ns(1);
	LCM_E_set;                            		// E高低电平时间最少为450ns
	Delay_ns(1);															// 2次写间隔不能太长，否则容易显示乱码
	LCM_E_clr;                            		// E高低电平时间最少为450ns
	Delay_ns(1);
	// 写低半字节
	GPIOD->ODR &= 0xff0f;
	lcdbuff_1 &= 0x0f;
	lcdbuff_1 <<= 4;
	GPIOD->ODR |= lcdbuff_1;
	GPIOA->ODR &= 0xfeff;
	Delay_ns(1);
	LCM_E_set;                            	 
	Delay_ns(1);
	LCM_E_clr;                            	 
	Delay_1ms(5);
}

//-----------------------------------------------------------------
// void CG_Write (void)
//-----------------------------------------------------------------
//
// 函数功能: 将自定义的字符送到CGRAM,以便使用时调用
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)     
// 注意事项: 
//-----------------------------------------------------------------
void CG_Write (void)
{
	u8 i;

	WrCLcdC(0x40);						      					// 设置LCM的CGRAM首地址
	for (i=0; i<64; i++)                			// 共设置8个5*8字符
	{
		WrCLcdD(CGTab[i]);
	}
}

//-----------------------------------------------------------------
// void WrCLcd_char_num (u8 x, u8 y, u8 num)
//-----------------------------------------------------------------
//
// 函数功能: 显示十进制无符号字符数据
// 入口参数: x:行, y:列, num:无符号字符型数据
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)     
// 注意事项: 显示数据格式为左对齐方式; x的值只能为1或2, y≤16
//-----------------------------------------------------------------
void WrCLcd_char_num (u8 x, u8 y, u8 num)
{
	u8  zc_flag;  														// 高位为零标志
	u8 i;
	u8 date_bufc[4] = {"    "};	 					  	// 缓存数组

	zc_flag = 0;  						     // '1':电平表示已经有非零数据出现过

	// 设置LCM显示DDRAM起始地址
  if (x == 1)
		WrCLcdC(0x80+y-0x01);										// 第一行
	else 
		WrCLcdC(0xc0+y-0x01);										// 第二行
	// 显示数据	 								
	if (num != 0)
	{
		date_bufc[0] = ((num % 1000) / 100) + 48;// 取出数据最高位
		date_bufc[1] = ((num % 100) / 10) + 48;
		date_bufc[2] = (num % 10) + 48;					// 取出数据最低位
	
		for (i = 0; i < 3; i ++)
		{
			if ((date_bufc[i] != '0') && (zc_flag == 0))
			{
				zc_flag = 1;
			}
			if (zc_flag == 1)
			{
				WrCLcdD(date_bufc[i]);
			}
		}
	}
	else 
	{
		WrCLcdD('0');
	}
}

//-----------------------------------------------------------------
// void WrCLcd_int_num (u8 x, u8 y, u16  num)
//-----------------------------------------------------------------
//
// 函数功能: 显示十进制无符号整型数据
// 入口参数: x:行, y:列, u8_num:无符号整型数据
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)     
// 注意事项: 显示数据格式为左对齐方式; x的值只能为1或2, y≤16
//-----------------------------------------------------------------
void WrCLcd_int_num (u8 x, u8 y, u16  num)
{
	u8   zi_flag;  														// 高位为零标志
	u8 i;
	u8 date_bufi[6] = {"      "};	 						// 缓存数组

	zi_flag = 0;  									// '1':电平表示已经有非零数据出现过

	// 设置LCM显示DDRAM起始地址
  if (x == 1)
		WrCLcdC(0x80+y-0x01);										// 第一行
	else 
		WrCLcdC(0xc0+y-0x01);										// 第二行
	// 显示数据	 								
	if (num != 0)
	{
		date_bufi[0] = ((num % 100000) / 10000) + 48;
		date_bufi[1] = ((num % 10000) / 1000) + 48;		
		date_bufi[2] = ((num % 1000) / 100) + 48;			
		date_bufi[3] = ((num % 100) / 10) + 48;				
		date_bufi[4] =  (num % 10) + 48;							
	
		for (i = 0; i < 5; i ++)
		{
			if ((date_bufi[i] != '0') && (zi_flag == 0))
			{
				zi_flag = 1;
			}
			if (zi_flag == 1)
			{
				WrCLcdD(date_bufi[i]);
			}
		}
	}
	else 
	{
		WrCLcdD('0');
	}
}

//-----------------------------------------------------------------
// void WrCLcd_long_num (u8 x, u8 y, unsigned long num)
//-----------------------------------------------------------------
//
// 函数功能: 显示十进制无符号长整型数据
// 入口参数: x:行, y:列, u8_num:无符号长整形数据
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)     
// 注意事项: 显示数据格式为左对齐方式; x的值只能为1或2, y≤16
//-----------------------------------------------------------------
void WrCLcd_long_num (u8 x, u8 y, unsigned long num)
{	u8   zl_flag;  															// 高位为零标志
	u8 i;
	u8 date_bufl[11] = {"           "}; 				// 缓存数组

	zl_flag = 0;  									 // '1':电平表示已经有非零数据出现过

	// 设置LCM显示DDRAM起始地址
  if (x == 1)
		WrCLcdC(0x80+y-0x01);											// 第一行
	else 
		WrCLcdC(0xc0+y-0x01);											// 第二行
	// 显示数据	 								
	if (num != 0)
	{
		date_bufl[0] = ((num % 10000000000) / 1000000000) + 48;	 
		date_bufl[1] = ((num % 1000000000) / 100000000) + 48;		 
		date_bufl[2] = ((num % 100000000) / 10000000) + 48;			 
		date_bufl[3] = ((num % 10000000) / 1000000) + 48;			 
		date_bufl[4] = ((num % 1000000) / 100000) + 48;				 
		date_bufl[5] = ((num % 100000) / 10000) + 48;					 
		date_bufl[6] = ((num % 10000) / 1000) + 48;						 
		date_bufl[7] = ((num % 1000) / 100) + 48;							 
		date_bufl[8] = ((num % 100) / 10) + 48;							 
		date_bufl[9] =  (num % 10) + 48;											 
	
		for (i = 0; i < 10; i ++)
		{
			if ((date_bufl[i] != '0') && (zl_flag == 0))
			{
				zl_flag = 1;
			}
			if (zl_flag == 1)
			{
				WrCLcdD(date_bufl[i]);
			}
		}
	}
	else 
	{
		WrCLcdD('0');
	}
}

//-----------------------------------------------------------------
// 应用程序区
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// void Wr_In1 (void)
//-----------------------------------------------------------------
//
// 函数功能: 第一行显示Welcome to use!
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)
// 注意事项:
//----------------------------------------------------------------- 
void Wr_In1 (void)
{
	u8 i;
	// 设置LCM输入方式:读写操作后AC自增1
	WrCLcdC(0x06);						   
	// 设置LCM显示DDRAM起始地址   
	WrCLcdC(0x80);						      
	for (i=0; i<15; i++)
	{
		WrCLcdD(tab1[i]);		
	}
}

//-----------------------------------------------------------------
// void Wr_In2 (void)
//-----------------------------------------------------------------
//
// 函数功能: 第二行显示Tel:13950369220
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)
// 注意事项:
//----------------------------------------------------------------- 
void Wr_In2 (void)
{
	u8 i;
	// 设置LCM输入方式:读写操作后AC自增1
	WrCLcdC(0x06);					 
	// 设置LCM显示DDRAM起始地址	      
	WrCLcdC(0xc0);						     
	for (i=0; i<15; i++)
	{
		WrCLcdD(tab2[i]);
	}
}

//-----------------------------------------------------------------
// void CL_Enter (void)
//-----------------------------------------------------------------
//
// 函数功能: 第一行字符光标左移显示
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8);Delay_50ms(u8)
// 注意事项:
//-----------------------------------------------------------------
void CL_Enter (void)
{
	u8 i;
	// 设置LCM输入方式:AC自减1,画面不动
	WrCLcdC(0x04);						         
	// 第一行末开始
	WrCLcdC(0x8f);						   
	for (i=16; i>0; i--)
	{
		WrCLcdD(tab1[i-1]);
		Delay_50ms(2);
	}
}

//-----------------------------------------------------------------
// void CR_Enter (void)
//-----------------------------------------------------------------
//
// 函数功能: 第二行字符光标右移显示
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8);Delay_50ms(u8)
// 注意事项:
//-----------------------------------------------------------------
void CR_Enter (void)
{
	u8 i;
	// 设置LCM输入方式:AC自增1,画面不动
	WrCLcdC(0x06);						       
	// 第二行首开始
	WrCLcdC(0xc0);						     
	for (i=0; i<15; i++)
	{
		WrCLcdD(tab2[i]);
		Delay_50ms(2);
	}
}

//-----------------------------------------------------------------
// void L_Enter (void)
//-----------------------------------------------------------------
//
// 函数功能: 第一行字符画面左移显示
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8);Delay_50ms(u8)
// 注意事项:
//-----------------------------------------------------------------
void L_Enter (void)
{
	u8 i;
	// 设置LCM输入方式:AC自增1,画面平移
	WrCLcdC(0x07);						      
	// 第一行末开始
	WrCLcdC(0x8f);						      
	for (i=0; i<15; i++)
	{
		WrCLcdD(tab1[i]);
		Delay_50ms(5);
	}
}

//-----------------------------------------------------------------
// void R_Enter (void)
//-----------------------------------------------------------------
//
// 函数功能: 第一行字符画面右移显示
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8);Delay_50ms(u8)
// 注意事项:
//-----------------------------------------------------------------
void R_Enter (void)
{
	u8 i;
	// 设置LCM输入方式:AC自减1,画面平移
	WrCLcdC(0x05);						      	
	// 第一行末开始
	WrCLcdC(0x8f);						      					
	for (i=15; i>0; i--)
	{
		WrCLcdD(tab1[i]);
		Delay_50ms(5);
	}
}

//-----------------------------------------------------------------
// void CGWrite (void)
//-----------------------------------------------------------------
//
// 函数功能: 产品信息显示
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: WrCLcdC(u8);WrCLcdD(u8)
// 注意事项:
//-----------------------------------------------------------------
void CGWrite (void)
{
	u8 i;

	WrCLcdC(0x06);
	WrCLcdC(0x80);                      			// 第一行
	for (i=0; i<16; i++)
	{
		WrCLcdD(tabdy[i]);		
	}
	WrCLcdC(0xc0);                      			// 第二行
	for (i=16; i<32; i++)
	{
		WrCLcdD(tabdy[i]);		
	}
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------


