//-----------------------------------------------------------------
// ³ÌÐòÃèÊö:
// ¡¡	 MB1504·ÖÆµÆ÷·ÖÆµ²âÊÔ³ÌÐò
// ×÷¡¡¡¡Õß: ÁèÖÇµç×Ó
// ¿ªÊ¼ÈÕÆÚ: 2017-01-28
// Íê³ÉÈÕÆÚ: 2017-01-28
// ÐÞ¸ÄÈÕÆÚ:  
// µ±Ç°°æ±¾: V1.0
// ÀúÊ·°æ±¾:
// ¡¡- V1.0: 
// µ÷ÊÔ¹¤¾ß: ÁèÖÇSTM32+FPGAµç×ÓÏµÍ³Éè¼Æ¿ª·¢°å¡¢LZE_ST_LINK2
// Ëµ¡¡¡¡Ã÷: 
// ²âÊÔ¹¦ÄÜ: 
//		 Òý½ÅÁ¬½Ó: 	µ¥Æ¬»ú    MB1504Ä£¿é
//                PA4-->CLK		PA5-->DATA		PA7-->LE		
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// Í·ÎÄ¼þ°üº¬==-----------------------------
#include <stm32f10x.h>
#include "MB1504.h"
#include "delay.h"

//-----------------------------------------------------------------
// ³õÊ¼»¯³ÌÐòÇø
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// void GPIO_MB1504_Configuration(void)
//-----------------------------------------------------------------
// 
// º¯Êý¹¦ÄÜ: MB1504 GPIOÅäÖÃ
// Èë¿Ú²ÎÊý: ÎÞ 
// ·µ »Ø Öµ: ÎÞ
// È«¾Ö±äÁ¿: ÎÞ
// µ÷ÓÃÄ£¿é: RCC_APB2PeriphClockCmd();GPIO_Init();
// ×¢ÒâÊÂÏî: ÎÞ
//
//-----------------------------------------------------------------
void GPIO_MB1504_Configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	// Ê¹ÄÜIO¿ÚÊ±ÖÓ
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE);  
	
	// GPIOÅäÖÃ  
															//	PA4	=CLK		PA5=DATA		PA7=LE
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5| GPIO_Pin_7;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	// ÍÆÍìÊä³ö
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
}

//-----------------------------------------------------------------
//Send16Bit(uint SendData)	
//-----------------------------------------------------------------
//
// º¯Êý¹¦ÄÜ: »ù×¼·ÖÆµÊý¾ÝÐ´Èë
// Èë¿Ú²ÎÊý: SendDataÞ
// ·µ»Ø²ÎÊý: ÎÞ 
// È«¾Ö±äÁ¿: ÎÞ
// µ÷ÓÃÄ£¿é: 
// ×¢ÒâÊÂÏî: 
//-----------------------------------------------------------------
void Send16Bit(uint SendData)												//»ù×¼·ÖÆµ  Ð´Èë16Î»Êý¾Ý
{
	uchar i;
	uint SendMiddle;
	SendMiddle=SendData;
	LE_0;
	CLK_0;
	for(i=0;i<16;i++)																	//¸ßÎ»ÏÈÐ´Èë
	{
		if((SendMiddle & 0x8000)==0x8000)
		{
			DATA_1;
		}
		else
		{
			DATA_0;
		}
		Delay_1us (2);
		CLK_1;																					//Ð´ÈëÊý¾Ý
		Delay_1us (2);
		CLK_0;
		SendMiddle= SendMiddle<<1;
	}
	LE_1;
	Delay_1us (2);
	LE_0;
}

//-----------------------------------------------------------------
//Send11Bit(uint SendData) 
//-----------------------------------------------------------------
//
// º¯Êý¹¦ÄÜ: ·ÖÆµ¸ß11Î»Êý¾ÝÐ´Èë
// Èë¿Ú²ÎÊý: SendData
// ·µ»Ø²ÎÊý: ÎÞ 
// È«¾Ö±äÁ¿: ÎÞ
// µ÷ÓÃÄ£¿é: 
// ×¢ÒâÊÂÏî: 
//-----------------------------------------------------------------
void Send11Bit(uint SendData)   										
{   
  uchar i;   
  LE_0;       
	CLK_0;   
  for( i = 0; i < 11; i ++ )   
  {   
		if((SendData & 0x8000)==0x8000)
		{
			DATA_1;
		}
		else
		{
			DATA_0;
		}		
    Delay_1us (2);      
		CLK_1;   
    Delay_1us (2);        
		CLK_0;   
    SendData = SendData << 1;   
  }   
}   

//-----------------------------------------------------------------
//Send8Bit( uchar SendData )   
//-----------------------------------------------------------------
//
// º¯Êý¹¦ÄÜ: ·ÖÆµµÍ8Î»Êý¾ÝÐ´Èë
// Èë¿Ú²ÎÊý: SendData
// ·µ»Ø²ÎÊý: ÎÞ 
// È«¾Ö±äÁ¿: ÎÞ
// µ÷ÓÃÄ£¿é: 
// ×¢ÒâÊÂÏî: 
//-----------------------------------------------------------------	
void Send8Bit( uchar SendData )   													//Ð´ÈëµÍ8Î»Êý¾Ý
{   
  uchar i;    
  for( i = 0; i < 8; i ++ )   
  {   
		if((SendData & 0x80)==0x80)
		{
			DATA_1;
		}
		else
		{
			DATA_0;
		}				
    Delay_1us (2);        
		CLK_1;   
    Delay_1us (2);        
		CLK_0;   
    SendData = SendData << 1;   
   }   
		LE_1;        
  	Delay_1us (2);        
	  LE_0;   
}   

//-----------------------------------------------------------------
//SendReferF( void ) 
//-----------------------------------------------------------------
//
// º¯Êý¹¦ÄÜ: »ù×¼·ÖÆµÊý¾ÝÐ´Èë
// Èë¿Ú²ÎÊý: ÎÞ
// ·µ»Ø²ÎÊý: ÎÞ 
// È«¾Ö±äÁ¿: ÎÞ
// µ÷ÓÃÄ£¿é: 
// ×¢ÒâÊÂÏî: 
//-----------------------------------------------------------------
void SendReferF( void )   
{  		//Õë¶Ô²ÉÓÃ12M¾§Õñ
  Send16Bit( 0x8961 ); // »ù×¼·ÖÆµ Ä¬ÈÏ10kÊ±ÖÓÊä³ö
}   
   
void FrequenceToSend( uint FrequenceD )   
{   
  uchar AD = 0;       
  uint  ND = 0;      
	uint MiddleF = 2000;   
   
          MiddleF = FrequenceD;   								//·ÖÆµÏµÊýPÎª32
          ND = ( uint  ) ( MiddleF / 32 );    	 //·ÖÆµÖµ=32*ND+AD;		
          AD = ( uchar ) ( MiddleF % 32 );   
          ND = ND << 5;                
	
					AD = AD << 1;       										//×îµÍÎ»Îª¿ØÖÆÎ»£¬
					AD = AD & 0xfe;													//¿ØÖÆÎ» ÖÃµÍ;
          Send11Bit( ND );        								
					Send8Bit( AD );   
}   


//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
